In [2]:
import pandas as pd

In [31]:
players = pd.read_csv(r'dados\players.csv')

In [32]:
players.sort_values(by='sofifa_id', ascending=True)

       sofifa_id                             name player_positions
316           41             Andres Iniesta Lujan          CM, CAM
239         1179                 Gianluigi Buffon               GK
3416        2147             Maarten Stekelenburg               GK
16582       2702                    Kevin Ellison           LM, ST
3417        3281  Ricardo Jose Vaz Alves Monteiro          CM, CDM
...          ...                              ...              ...
12209     258953                  Ilmari Niskanen               LM
12953     258954    Rolando Valentin Ortiz Correa               CB
6339      258958               Oleksandr Filippov               ST
16257     258968                Jop van der Avert               CB
16129     258970             David Astals Barrera               ST

[18944 rows x 3 columns]

In [3]:
rating = pd.read_csv(r'C:\Users\biaso\Desktop\UFRGS\semestre3\cpd\Classificacao_e_Pesquisa_de_Dados\TrabFinal\dados\rating.csv')
rating.head()

   user_id  sofifa_id  rating
0    52505     158023     4.0
1    54989     158023     5.0
2     5409     158023     4.5
3   126061     158023     5.0
4     2782     158023     4.0

Para cada user do rating tem a resenha de um único jogador. Um user não resenha o mesmo jogador em mais de uma linha

In [4]:
teste = rating[rating['user_id'] == 4]
teste

          user_id  sofifa_id  rating
447267          4     168542     4.5
512044          4     208830     4.5
665331          4     182493     2.5
994453          4     211256     3.0
1159941         4     172871     3.5
...           ...        ...     ...
23678105        4     257095     2.0
23824164        4     255071     3.0
23900968        4     248237     2.0
24010144        4     251563     3.0
24120905        4     252760     2.0

[188 rows x 3 columns]

user id vai do 1 até 138493

In [10]:
if list(range(1,138494)) == list(sorted(rating['user_id'].unique())):
    print(1)
else:
    print(2)

1

In [22]:
minirating = pd.read_csv('dados\minirating.csv')
minirating

      user_id  sofifa_id  rating
0      118046     256417     1.5
1       97952     186941     2.5
2       24379     190149     4.0
3       12389     134779     2.0
4      135376     239134     1.5
...       ...        ...     ...
9995   102968     245088     2.0
9996    89113     163083     2.5
9997    55423     176137     2.0
9998   103551     232999     1.5
9999    33253     195396     1.5

[10000 rows x 3 columns]

In [18]:
minirating['user_id'].apply(int)

0       118046
1        97952
2        24379
3        12389
4       135376
         ...
9995    102968
9996     89113
9997     55423
9998    103551
9999     33253
Name: user_id, Length: 10000, dtype: int64

In [19]:
minirating['user_id'].value_counts()

130642    4
20267     3
93254     3
44980     3
9225      3
         ..
122021    1
122351    1
121995    1
25026     1
33253     1
Name: user_id, Length: 9642, dtype: int64

In [27]:
teste = minirating[minirating['user_id'] == 130642]
teste = teste.sort_values(by='rating', ascending=False)
teste

      user_id  sofifa_id  rating
652    130642     229683     4.0
7418   130642     252270     4.0
5487   130642     240600     3.5
6843   130642     207768     2.5